src/DataProcessors/РегистрацияКассиров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>РегистрацияКассиров</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипФормы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/InformationRegisters/ФактическийУчетРабочегоВремени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ФактическийУчетРабочегоВремени</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НаРаботе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МестоРеализации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаРеализации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/DataProcessors/РегистрацияКассиров/Ext/ObjectModule.bsl
Функция ПроверитьНаРаботе() Экспорт
	глПараметрыРМ = глПараметрыРМ;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ФактическийУчетРабочегоВремениСрезПоследних.Период,
	               |	ФактическийУчетРабочегоВремениСрезПоследних.НаРаботе
	               |ИЗ
	               |	РегистрСведений.ФактическийУчетРабочегоВремени.СрезПоследних(
	               |			&Период,
	               |			Сотрудник = &Сотрудник
	               |				И МестоРеализации = &МестоРеализации
	               |				) КАК ФактическийУчетРабочегоВремениСрезПоследних
	               |ГДЕ
	               |	ФактическийУчетРабочегоВремениСрезПоследних.Период МЕЖДУ НАЧАЛОПЕРИОДА(&Период, ДЕНЬ) И КОНЕЦПЕРИОДА(&Период, ДЕНЬ)";
	Запрос.УстановитьПараметр("Период",ТекущаяДата());
	Запрос.УстановитьПараметр("Сотрудник",Сотрудник);
	Запрос.УстановитьПараметр("МестоРеализации",глПараметрыРМ.МестоРеализации);
	Запрос.УстановитьПараметр("параметр",истина);
	Результат = Неопределено;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.НаРаботе Тогда
			Результат = Выборка.Период;
		КонецЕсли;
	КонецЦикла;
	Если ПроцедурыОбменаДанными.ОпределитьЭтаИнформационнаяБазаФайловая() Тогда
		Возврат Истина;
	Иначе
		Возврат Результат;
	КонецЕсли;
КонецФункции
